Repository: yoko-at-home/reactjs-docs-TM
Catalog: docs/reference-javascript-environment-requirements_EN-US_ja.tmx
Source language: en_us
Languages: ja

source: --- id: javascript-environment-requirements title: JavaScript Environment Requirements layout: docs category: Reference permalink: docs/javascript-environment-requirements.html ---
ja: --- id: javascript-environment-requirements title: JavaScript 環境の要件 layout: docs category: Reference permalink: docs/javascript-environment-requirements.html ---

source: React 16 depends on the collection types [Map](https://developer.mozilla.org/en-US/docs/Web/JavaScript/Reference/Global_Objects/Map) and [Set](https://developer.mozilla.org/en-US/docs/Web/JavaScript/Reference/Global_Objects/Set).
ja: React 16 はコレクション型 [Map](https://developer.mozilla.org/en-US/docs/Web/JavaScript/Reference/Global_Objects/Map) および [Set](https://developer.mozilla.org/en-US/docs/Web/JavaScript/Reference/Global_Objects/Set) に依存しています。

source: If you support older browsers and devices which may not yet provide these natively (e.g. IE < 11) or which have non-compliant implementations (e.g. IE 11), consider including a global polyfill in your bundled application, such as [core-js](https://github.com/zloirock/core-js).
ja: これらの機能をネイティブに提供しない（IE 11 未満など）、または標準非準拠な挙動をする（IE 11 など）古いブラウザやデバイスをサポートする場合は、[core-js](https://github.com/zloirock/core-js) のようなグローバルなポリフィルをバンドルしたアプリケーションに含めることを検討してください。

source: A polyfilled environment for React 16 using core-js to support older browsers might look like:
ja: 古いブラウザをサポートするため、core-js を利用してポリフィルを含めた React 16 向けの環境は次のようになります。

source: React also depends on `requestAnimationFrame` (even in test environments).
ja: React は（テスト環境であっても）`requestAnimationFrame` に依存します。

source: You can use the [raf](https://www.npmjs.com/package/raf) package to shim `requestAnimationFrame`:
ja: `requestAnimationFrame` の役割を補うため [raf](https://www.npmjs.com/package/raf) を使用します。
